Для анализа RAW-образа диска в read-only режиме можно воспользоваться следующим набором команд:
1) Если образ состоит из одного раздела, то можно использовать losetup с опцией r
sudo losetup -r /dev/loop0 disk.img
Или, когда нужно анализировать образ из нескольких разделов:
sudo kpartx -rav disk.img
В этом случае нужные устройства появятся в папке /dev/mapper с названиями вида loopXpY,
с ними далее можно работать как с обычными блочными устройствами.
3) Если для анализа недостаточно средств основной операционной системы, можно смонтировать диск в виртуальной машине.
Для VirtualBox диск создаётся командой:
VBoxManage internalcommands createrawvmdk -filename "</path/to/file>.vmdk" -rawdisk /dev/loopX
Затем, с помощью команд chmod или setfacl настраиваются права на чтение исходного устройства пользователем, из-под
которого запущена VM, после этого получившийся VMDK-файл можно использовать как обычный виртуальный ЖД.
4) Для завершения работы диски размонтируются и убираются командами
sudo losetup -d /dev/loop0
sudo kpartx -rav disk.img
